In [67]:
import pandas

In [39]:
names=["Tom치s", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [40]:
friends={'names':names, 'woman':woman, 'ages':ages, 'country':country, 'education':education}

In [41]:
friends=pandas.DataFrame.from_dict(friends)
friends

     names  woman  ages  country education
0    Tom치s  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

In [42]:
list(zip(names, country))

[('Tom치s', 'Chile'),
 ('Pauline', 'Senegal'),
 ('Pablo', 'Spain'),
 ('Bjork', 'Norway'),
 ('Alan', 'Peru'),
 ('Juana', 'Peru')]

In [70]:
Peruvians=0
for country in friends.country:
    if country not 'Peru':
        Peruvians +=1
    
Peruvians

2

In [75]:
Men=0
for woman in friends.woman:
    if woman not True:
        Men +=1

Men

SyntaxError: invalid syntax (<ipython-input-75-c14170710b8d>, line 3)